Revit 2027 API
AdvancedLossFactor Methods
The AdvancedLossFactor type exposes the following members.
Methods
Name | Description
Clone |  Creates a copy of the LossFactor derived object.
(Inherited from LossFactor)
Dispose
(Inherited from LossFactor)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
AdvancedLossFactor Class
Autodesk.Revit.DB.Lighting Namespace